// SortOptions.js
import React from "react";

const SortOptions = ({
  sortOrder,
  sortReviews,
  toggleSortOrder,
  toggleSortReviews,
}) => {
  return (
    <div
      className="sort-options filter__popup popup-content"
      id="popupSort"
      onChange={(e) => console.log("Выбранная опция:", e.target.value)}
    >
      <button onClick={toggleSortOrder} className="sort-options__button">
        По рейтингу{" "}
        {sortOrder === "desc" ? (
          <svg
            className="sort-options__icon"
            width="16"
            height="28"
            viewBox="0 0 16 28"
            fill="none"
          >
            <path
              d="M7.44963 27.3216C7.84016 27.7121 8.47332 27.7121 8.86385 27.3216L15.2278 20.9576C15.6183 20.5671 15.6183 19.9339 15.2278 19.5434C14.8373 19.1529 14.2041 19.1529 13.8136 19.5434L8.15674 25.2002L2.49988 19.5434C2.10936 19.1529 1.4762 19.1529 1.08567 19.5434C0.695147 19.9339 0.695147 20.5671 1.08567 20.9576L7.44963 27.3216ZM7.15674 0.108429L7.15674 26.6145L9.15674 26.6145L9.15674 0.108429L7.15674 0.108429Z"
              fill="#3066BE"
            />
          </svg>
        ) : (
          <svg
            className="sort-options__icon"
            xmlns="http://www.w3.org/2000/svg"
            width="16"
            height="28"
            viewBox="0 0 16 28"
            fill="none"
          >
            <path
              d="M8.78972 0.294011C8.39988 -0.0971974 7.76671 -0.0983072 7.3755 0.291532L1.0004 6.64433C0.60919 7.03417 0.60808 7.66733 0.997919 8.05854C1.38776 8.44975 2.02092 8.45086 2.41213 8.06102L8.07889 2.41409L13.7258 8.08085C14.1157 8.47206 14.7488 8.47317 15.14 8.08333C15.5312 7.69349 15.5324 7.06032 15.1425 6.66912L8.78972 0.294011ZM9.03491 27.5076L9.08137 1.00163L7.08137 0.998124L7.03491 27.5041L9.03491 27.5076Z"
              fill="#3066BE"
            />
          </svg>
        )}
      </button>
      <button onClick={toggleSortReviews} className="sort-options__button">
        По количеству отзывов{" "}
        {sortReviews === "desc" ? (
          <svg
            className="sort-options__icon"
            width="16"
            height="28"
            viewBox="0 0 16 28"
            fill="none"
          >
            <path
              d="M7.44963 27.3216C7.84016 27.7121 8.47332 27.7121 8.86385 27.3216L15.2278 20.9576C15.6183 20.5671 15.6183 19.9339 15.2278 19.5434C14.8373 19.1529 14.2041 19.1529 13.8136 19.5434L8.15674 25.2002L2.49988 19.5434C2.10936 19.1529 1.4762 19.1529 1.08567 19.5434C0.695147 19.9339 0.695147 20.5671 1.08567 20.9576L7.44963 27.3216ZM7.15674 0.108429L7.15674 26.6145L9.15674 26.6145L9.15674 0.108429L7.15674 0.108429Z"
              fill="#3066BE"
            />
          </svg>
        ) : (
          <svg
            className="sort-options__icon"
            xmlns="http://www.w3.org/2000/svg"
            width="16"
            height="28"
            viewBox="0 0 16 28"
            fill="none"
          >
            <path
              d="M8.78972 0.294011C8.39988 -0.0971974 7.76671 -0.0983072 7.3755 0.291532L1.0004 6.64433C0.60919 7.03417 0.60808 7.66733 0.997919 8.05854C1.38776 8.44975 2.02092 8.45086 2.41213 8.06102L8.07889 2.41409L13.7258 8.08085C14.1157 8.47206 14.7488 8.47317 15.14 8.08333C15.5312 7.69349 15.5324 7.06032 15.1425 6.66912L8.78972 0.294011ZM9.03491 27.5076L9.08137 1.00163L7.08137 0.998124L7.03491 27.5041L9.03491 27.5076Z"
              fill="#3066BE"
            />
          </svg>
        )}
      </button>
    </div>
  );
};

export default SortOptions;
